Autodesk.Revit.DB.Analysis.MassZone.GetMassDataElementIdForZoneFaceReference(Autodesk.Revit.DB.Reference)
MassZone faces come from faces of MassEnergyAnalyticalModel, and those faces have MassSurfaceData
or MassLevelData elements associated with them.
Remarks:
This element will contain the properties associated with the MassEnergyAnalyticalModel face or MassLevelData
that the MassZone Face is derived from.
referenceOfZone:
Reference to face of the MassZone to get data element for.
Returns:
Id of MassSurfaceData or MassLevelData element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.GetReferencesToEnergyAnalysisFaces
Used to get References to all the faces of the MassZone that are used for Energy Analysis.
Remarks:
These are the faces and face regions that are typically visible to the user
when MassZones are displayed.  There are other faces in the MassZone geometry
that are not visible and not used for EnergyAnalysis.
Returns:
Array of References to faces of MassZone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.GetCoincidentReferenceFromAdjacentZone(Autodesk.Revit.DB.Reference)
This method is used to get a Reference from an adjacent MassZone that is coincident to a Reference of this MassZone.
Remarks:
The result is always a Reference to a Face. The Reference Type should report as REFERENCE_TYPE_SURFACE.
Currently Revit improperly reports it as REFERENCE_TYPE_NONE.
The results are always references to Faces.
referenceToZoneFace:
Reference to face of MassZone.
Returns:
Reference to coincident face of adjacent MassZone or null if there is no adjacent MassZone face Reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.GetEquivalentReferenceFromMassOrLevel(Autodesk.Revit.DB.Reference)
Returns a Reference to a face of a MassEnergyAnalyticalModel element or
an element Reference to a MassLevelData element.
This Reference represents what the MassZone face was "cut from" when making the MassZone for the level.
Remarks:
If the Reference is to a MassLevelData element, it means that the MassEnergyAnalyticalModel element
did not have an exterior face for this MassZone face.  For this case, the MassZone face was created
as the cross-section of the MassEnergyAnalyticalModel geometry where it was intersected by the level
of the MassLevelData.
referenceToZoneFace:
Reference to a face of the zone to get an equivalent reference for.
Returns:
Reference to MassEnergyAnalyticalModel or MassLevelData.  Should only be null if there is an error
in the MassEnergyAnalyticalModel data or the input is not a
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input Reference is not a face Reference of this MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.IsEmpty
Indicates if MassZone has no geometry.  Such zones should not be shown to the user.
Returns:
Returns True if MassZone has no geometry.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.SpaceTypeId
The space type element of the MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.SpaceType
The gbXMLSpaceType of the MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The space type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.ConditionType
The gbXMLConditionType of the MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The condition type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.CutByUpperLevel
Indicates the relationship between the MassZone and its upper level.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.CutByLowerLevel
Indicates the relationship between the MassZone and its lower level.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.MassEnergyAnalyticalModelId
The ElementId of the MassEnergyAnalyticalModel that the MassZone is derived from.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.IsZoneOccupiable
A MassZone must have a level as its bottom to be occupiable;
If it does not, it is still a MassZone, but it is not occupiable
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.MaterialType
Indicates how the material of MassZone faces is determined.
Remarks:
The material of the MassZone faced will be determined in the following ways based on the material type.
MassZoneMaterialTypeMaterialBySurfaceType:  Each MassZone face will use the material defined by the object style of the subcategory
of the Element returned by getMassDataElementIdForZoneFaceReference(..).
MassZoneMaterialTypeNormalMaterial:  If the materialId is InvalidElementId, then the material defined by the object style of the MassZone
subcategory will be used for all faces of the MassZone.
MassZoneMaterialTypeNormalMaterial: If the materialId is the id of a Material element, that material id will be used for all faces of the MassZone.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The material type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.MaterialId
The visualization material for the MassZone.
Will be InvalidElementId if material is by category or the material type is by MassZoneMaterialTypeMaterialBySurfaceType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element materialId is not a material element.
-or-
When setting this property: The MassZone does not have normal material type handling, so the material setting is not appropriate.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.UpperLevelId
The upper level defining the MassZone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.LowerLevelId
The bottom level defining the MassZone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.FloorArea
The floor area of the MassZone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone.Volume
The volume of the MassZone.
Since:
2012

Autodesk.Revit.DB.Analysis.MassZone
MassZones are created from the MassEnergyAnalyticalModel.  They are conceptual representations of individually heated and cooled sub-volumes of a building.
Remarks:
MassZones are created by dividing a MassEnergyAnalyticalModel into pieces by intersecting MassLevelDatas associated with a Mass FamilyInstance
with the geometries of the MassEnergyAnalyticalModel associated with the same Mass FamilyInstance.
Since:
2012